; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Description
;;; ------------
;;; A manipulator works in an environment in
;;; which...
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain MANIPULATOR)
  (:requirements :strips :typing)
  (:types block				;This is the object that is supposed to be manipulated
	  door				;This can be opened or closed
	  location			;Location at which obstruction is safe
  )

  (:predicates (m-at ?l - location)
	       (b-at ?b - block ?l - location)
	       (d-at ?d - door ?l1 ?l2 - location)
	       (adjacent ?l1 ?l2 - location)
 	       (holding ?b - block)
	       (on ?b1 ?b2 - block)
	       (onground ?b - block)
	       (clear ?b - block)
	       (empty ?l - location)
	       (free-grippers)
  )

  (:action move
	     :parameters (?from ?to - location)
	     :precondition 
		(and (m-at ?from)
		(adjacent ?from ?to))
	     :effect
		(and (m-at ?to)
		(not(m-at ?from)))
  )


  (:action place
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(empty ?l)
		(holding ?b))
	     :effect
	        (and (free-grippers)
		(not(holding ?b))
		(b-at ?b ?l)
		(clear ?b)
		(not(empty ?l))
		(onground ?b))
  )


  (:action stack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?bbottom ?l)
		(clear ?bbottom)
		(holding ?btop))
	     :effect
	        (and (free-grippers)
		(not(holding ?btop))
		(b-at ?btop ?l)
		(on ?btop ?bbottom)
		(not(clear ?bbottom))
		(clear ?btop))
  )


  (:action pickup
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?b ?l)
		(onground ?b)
		(clear ?b)
		(free-grippers))
	     :effect
		(and (holding ?b)
		(not(b-at ?b ?l))
		(not(free-grippers))
		(not(onground ?b))
		(empty ?l)
		(not(clear ?b)))
  )

  (:action destack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?btop ?l)
		(b-at ?bbottom ?l)
		(clear ?btop)
		(on ?btop ?bbottom)
		(free-grippers))
	     :effect
		(and (holding ?btop)
		(not(b-at ?btop ?l))
		(not(free-grippers))
		(not(on ?btop ?bbottom))
		(not(clear ?btop))
		(clear ?bbottom))
  )


  (:action open
	     :parameters (?d - door ?unlockable ?locked - location)
	     :precondition 
		(and (m-at ?unlockable)
		(d-at ?d ?unlockable ?locked)
		(free-grippers))
	     :effect
		(and (adjacent ?unlockable ?locked)
		(adjacent ?locked ?unlockable))
  )

)

; problem
(define (problem MANIPULATOR-1)

(:domain MANIPULATOR)
  (:objects
	L1 L2 L3 - location
	B1 B2 B3 B4 B5 B6 - block
  )

  (:init
	(m-at L2)
	(holding B4)
	(adjacent L1 L2)(adjacent L2 L1)
	(adjacent L2 L3)(adjacent L3 L2)
	(b-at B1 L1)(b-at B2 L1)(b-at B3 L1)
	(onground B1)(on B2 B1)(on B3 B2)(clear B3)
	(b-at B5 L2)
	(onground B5)(clear B5)
	(b-at B6 L3)
	(onground B6)(clear B6)
  )

  (:goal 
	(and(b-at B1 L3)
	(on B2 B1)
	(on B3 B2)
	(on B4 B3)
	(on B5 B4)
	(on B6 B5))
  )
)

; plan
1. (stack b4 b5 l2)
   deleted: (holding b4) (clear b5)
   added: (free-grippers) (b-at b4 l2) (on b4 b5) (clear b4)
   goals met: 2 of 6
2. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 2 of 6
3. (destack b3 b2 l1)
   deleted: (b-at b3 l1) (free-grippers) (on b3 b2) (clear b3)
   added: (holding b3) (clear b2)
   goals met: 1 of 6
4. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 1 of 6
5. (stack b3 b4 l2)
   deleted: (holding b3) (clear b4)
   added: (free-grippers) (b-at b3 l2) (on b3 b4) (clear b3)
   goals met: 1 of 6
6. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 1 of 6
7. (destack b2 b1 l1)
   deleted: (b-at b2 l1) (free-grippers) (on b2 b1) (clear b2)
   added: (holding b2) (clear b1)
   goals met: 0 of 6
8. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 0 of 6
9. (stack b2 b3 l2)
   deleted: (holding b2) (clear b3)
   added: (free-grippers) (b-at b2 l2) (on b2 b3) (clear b2)
   goals met: 0 of 6
10. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 0 of 6
11. (pickup b1 l1)
   deleted: (b-at b1 l1) (free-grippers) (onground b1) (clear b1)
   added: (holding b1) (empty l1)
   goals met: 0 of 6
12. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 0 of 6
13. (stack b1 b2 l2)
   deleted: (holding b1) (clear b2)
   added: (free-grippers) (b-at b1 l2) (on b1 b2) (clear b1)
   goals met: 0 of 6
14. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 0 of 6
15. (pickup b6 l3)
   deleted: (b-at b6 l3) (free-grippers) (onground b6) (clear b6)
   added: (holding b6) (empty l3)
   goals met: 0 of 6
16. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 0 of 6
17. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 0 of 6
18. (place b6 l1)
   deleted: (holding b6) (empty l1)
   added: (free-grippers) (b-at b6 l1) (clear b6) (onground b6)
   goals met: 0 of 6
19. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 0 of 6
20. (destack b1 b2 l2)
   deleted: (b-at b1 l2) (free-grippers) (on b1 b2) (clear b1)
   added: (holding b1) (clear b2)
   goals met: 0 of 6
21. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 0 of 6
22. (place b1 l3)
   deleted: (holding b1) (empty l3)
   added: (free-grippers) (b-at b1 l3) (clear b1) (onground b1)
   goals met: 1 of 6
23. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 1 of 6
24. (destack b2 b3 l2)
   deleted: (b-at b2 l2) (free-grippers) (on b2 b3) (clear b2)
   added: (holding b2) (clear b3)
   goals met: 1 of 6
25. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 1 of 6
26. (stack b2 b1 l3)
   deleted: (holding b2) (clear b1)
   added: (free-grippers) (b-at b2 l3) (on b2 b1) (clear b2)
   goals met: 2 of 6
27. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 2 of 6
28. (destack b3 b4 l2)
   deleted: (b-at b3 l2) (free-grippers) (on b3 b4) (clear b3)
   added: (holding b3) (clear b4)
   goals met: 2 of 6
29. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 2 of 6
30. (stack b3 b2 l3)
   deleted: (holding b3) (clear b2)
   added: (free-grippers) (b-at b3 l3) (on b3 b2) (clear b3)
   goals met: 3 of 6
31. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 3 of 6
32. (destack b4 b5 l2)
   deleted: (b-at b4 l2) (free-grippers) (on b4 b5) (clear b4)
   added: (holding b4) (clear b5)
   goals met: 3 of 6
33. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 3 of 6
34. (stack b4 b3 l3)
   deleted: (holding b4) (clear b3)
   added: (free-grippers) (b-at b4 l3) (on b4 b3) (clear b4)
   goals met: 4 of 6
35. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 4 of 6
36. (pickup b5 l2)
   deleted: (b-at b5 l2) (free-grippers) (onground b5) (clear b5)
   added: (holding b5) (empty l2)
   goals met: 4 of 6
37. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 4 of 6
38. (stack b5 b4 l3)
   deleted: (holding b5) (clear b4)
   added: (free-grippers) (b-at b5 l3) (on b5 b4) (clear b5)
   goals met: 5 of 6
39. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 5 of 6
40. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 5 of 6
41. (pickup b6 l1)
   deleted: (b-at b6 l1) (free-grippers) (onground b6) (clear b6)
   added: (holding b6) (empty l1)
   goals met: 5 of 6
42. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 5 of 6
43. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 5 of 6
44. (stack b6 b5 l3)
   deleted: (holding b6) (clear b5)
   added: (free-grippers) (b-at b6 l3) (on b6 b5) (clear b6)
   goals met: 6 of 6
